{
  "date": "2020-05-03T14:15:20.483Z",
  "title": "New-Wave Shoyu Ramen",
  "author": "Ramen_Lord",
  "originalRecipe": "https://www.reddit.com/r/ramen/comments/blrqdd/homemade_next_on_my_tour_of_ramen_styles_newwave/",
  "intro": "I get asked all the time “Ramen_Lord, what if I don’t like fish? Can I make ramen??”\n\nOriginally, I said no. You need glutamate I said, you need synergistic compounds for umami.\n\nWell. I was wrong. There is a new style of shoyu in Japan emerging that focuses on chicken and soy sauce. Like… that’s all it uses. Instead of complexity, it opts for simplicity, with heritage birds and unique soy sauce blends. I’ve gone to Japan twice in the last 12 months, and there are a number of shops in Tokyo (and Sapporo even) doing this style. It is all about CHICKEN and SOY SAUCE. It is the regressive form of ramen.\n\nIt’s so addictive. I wanted to do the same thing in the US. And well… this. Is. It. I think I got lucky with this one. It’s bafflingly easy. The key is not a host of ingredients, not rare ingredients even really, but just to use the highest quality ingredients you can in every phase. That means free range, local, perhaps organic chicken, and imported, artisanal soy sauces. Kikkoman is ok, but you’ll need something better to really get the umami.\n\nI said this was easy, not cheap. But let’s do this thing.",
  "components": [
    {
      "name": "Soup",
      "description": "The soup is really easy. Again, find the best quality chicken you can, and you’ll be set.\n\nEssentially, the key part is the ratio: equal parts by weight of chicken and water. You do not want feet here, the backs at this ratio provide plenty of body to the soup. But as long as you have a 1:1 ratio, you can use as much or as little chicken as you want. Have a 4 lb bird? 4 lbs of water. That’s it. No ginger, no garlic, no onion, no scallion. Just two ingredients. The above are just examples. But keep in mind, one serving of soup is 350 ml of soup.\n\nDo keep the skin. You may be tempted to remove it to render the fat for later. But the skin also has collagen, which helps improve body, and flavor, which you want in the soup. So leave it in.",
      "ingredients": [
        "4 kg chicken backs (or about two chickens, breasts removed, broken down into primal cuts). Include all skin.",
        "4 L cold water"
      ],
      "steps": [
        "Add chicken and cold water to a stock pot.",
        "Heat on medium heat, until the soup begins to bubble",
        "Stir the contents of the pot. Skim the scum that rises to the top, Continue to simmer until little to no scum rises. This scum is off white to beige, any white scum can be left behind",
        "Turn the heat to the lowest setting on your stove, cover the pot, and let cook for 6 hours. Ideally the soup cooks at around 190F, below full bubble, as agitation will mess up the final clarity of the soup.",
        "Strain the soup, being careful not to disturb the bottom contents of the pot, to help with clarity. I actually ladle the soup out of the pot to avoid moving things around, then tip the pot at the very end to strain the last few drops.",
        "Let the fat settle, skim fat and reserve.",
        "If you were doing this in a pressure cooker (which I do, often), do the same as the above, but instead of step 4, cover and bring to high pressure, cook 20 minutes, then let depressurize naturally."
      ]
    },
    {
      "description": "There is no aroma oil. SURPRISE. It’s just chicken fat. But it’s a lot of chicken fat. Each bowl uses 30 ml (2 tbsp) of chicken fat, which you rendered in the soup making process above. 15 ml in the bottom of the bowl, and another 15 ml at the end after toppings. \n\nIf your chicken backs have skin, you should be able to render this easily.",
      "name": "Aroma oil"
    },
    {
      "name": "Tare",
      "description": "The tare, if you can even call it that, is also is super simple. Seeing a pattern yet?",
      "ingredients": [
        "450 g soy sauce",
        "50 g mirin",
        "You’ll also need some tamari for later. Same idea, use the best tamari you can find."
      ],
      "steps": [
        "Combine the soy sauce and mirin, store in the fridge as needed."
      ]
    },
    {
      "name": "Noodles",
      "description": "The noodles here are slightly-lower hydration straight Tokyo style noodle. They are firm, springy, and more taut than other recipes I’ve designed. I wanted something to kind of cut through the fat, really have nice presence. They’re also REALLY hard to do at home given their lower hydration, so only do these if you’re a glutton for punishment or have a nice noodle machine. The kitchenaid won’t save you here, frankly it will break if you try to use it. If you’re worried, bump up the water to 38 or even 39g, which will make things smoother at the expense of some firmness. You can also, of course, just use Sun Noodles. The Shoyu ones are great here.\n\nOf note, I now use distilled water for noodles. It’s not necessary, but if you’ve had trouble with your dough coming together, try using distilled water. The lack of trace minerals makes it extra hydrating for low-hydration doughs like ramen dough.\n\nIngredients Per portion (measure by weight):",
      "ingredients": [
        "99 g King Arthur bread flour",
        "1 g vital wheat gluten",
        "1 g egg white powder",
        "35 g water (preferably distilled)",
        "1 g salt",
        "1.2 g powdered kansui (using 80% sodium carbonate, or baked baking sodia, and 20% potassium carbonate)",
        "Optional: Pinch of Riboflavin (a literal pinch, less than .01 gram is all that’s required) for color"
      ],
      "steps": [
        "Add Sodium Carbonate, Potassium Carbonate, salt, (and riboflavin), to water, one at a time. Go slowly, stir constantly until clear. This will take awhile, but eventually the contents will dissolve. You can do this days in advance to get a jumpstart, just hold the liquid in an airtight container.",
        "In a standing mixer with a paddle attachment, add your flour, wheat gluten, and egg white powder, Turn the mixer to “stir” and run for 30 seconds to aerate the mix.",
        "While running the mixer on stir, add half of your water mixture slowly, in an even stream. Let the mixer stir the flour and water mixture for 5 minutes.",
        "Add in the remaining water mixture with the mixer running, run 3 minutes, or until the flour is evenly hydrated. You’ll know it’s ready when you grab the sandy mix and don’t have any residual powdery flour on your hands. Grainules or sandy reminants are ok, but if you see a powdery residue on your hands, keep mixing.",
        "Turn off the mixer and add the mixture to a ziplock style bag. Close, and let this rest for 1 hour at room temperature. Don’t skip this.",
        "Knead it, buy using an electric pasta machine to sheet the dough, going through the largest setting, then the 2nd, then the 3rd.\n\nTake the dough and fold it, sheeting under the 2nd widest setting, then fold it again and sheet it under the widest setting. Repeat this again, until the sheet is quite smooth and not ragged.",
        "After kneading the sheet, put the dough back in the plastic bag, and rest at room temp for another 30 minutes.",
        "Pull out your dough. Roll out to desired thickness with the pasta machine. You may need to cut the dough into more workable portions. That’s fine.",
        "Cut your noodles to your desired thickness. For me this is 1.5 mm by 1.5mm. (The marcato atlas comes with a 1.5 cutter, and rolled to a 5, is 1.5mm thick).",
        "Bundle the noodles into 140g portions, and place them, in the ziploc bag or sealed contained, in the fridge and allow to rest for at least one day."
      ]
    },
    {
      "name": "Chicken chashu",
      "description": "I don’t add an egg or chashu to this. You can if you want, but I like some simple sous vide chicken, a bit of boiled spinach, green onion, and nori. That’s really it.\n\nn the above bowl, I have two variants of the chicken chashu. One is cooked with salt and pepper, the other with a homemade shio koji. You can really do whatever you like. The shio koji gives the chicken a mild sweetness and a bit of complexity, but I also love salt and pepper. You can also buy shio koji on Amazon if you don’t want to make it. If you DO want to make it, Cooks Illustrated has the archetypical recipe.",
      "ingredients": [
        "Chicken breast",
        "Salt and Pepper OR Shio Koji"
      ],
      "steps": [
        "Preheat a sous vide waterbath to 145F",
        "Add chicken to a zip lock bag or sous vide bag. Add in desired seasoning. If using S&P... you probably know the drill. If using shio koji, add a few tablespoons per breast.",
        "Cook chicken via sous vide for 1.5-2 hours. If using a ziplock bag, use the water displacement method to remove air in the bag.",
        "Remove from the bath, shock in ice water to chill thoroughly, then cool in fridge, slice when ready. You can, conversely, open the bag, place the chicken into a sealed container, and chill in the fridge."
      ]
    },
    {
      "name": "Other toppings",
      "ingredients": [
        "Spinach, boiled for 20 seconds and cut into small pieces",
        "Green onion",
        "Nori"
      ]
    },
    {
      "name": "Assembly",
      "steps": [
        "Get mise en place ready. Heat water for boiling noodles, get your toppings all set, make sure the soup is warm. Have the chicken fat out, so that it has time to liquify at room temp, or heat it briefly in the microwave.",
        "Preheat your bowl in a 170 F oven. You can also heat with boiling water, prior to starting, just make sure to empty it.",
        "Bring the soup to a boil. Try not to boil it too long.",
        "Drop noodles, cook 1 minute and 30 seconds",
        "Add 45 ml (3 tbsp) of tare, and a few drops of tamari. Add a few grinds of black pepper too if you’d like (I like it).",
        "Add 15 ml (1 tbsp) chicken fat",
        "dd 350 ml (12 oz) boiling chicken soup",
        "Add noodles. Do noodle fold if you so like, by lifting the noodles up with chopsticks, trying to keep them gripped parallel to one another, then lay them down, and across, removing the chopsticks by pulling them towards you after the fold is complete, like sliding them out of the bundle as to not disturb it. 9.Add toppings.",
        "At the very end, add another 15 ml (1 tbsp) of chicken fat",
        "Eat immediately. Curse yourself for how easy this is"
      ]
    }
  ],
  "images": [
    "https://i.imgur.com/7MUou6u.jpg",
    "https://i.imgur.com/O0Gc8Yh.jpg",
    "https://i.imgur.com/ajhG5fE.jpg",
    "https://i.imgur.com/TJpvelp.jpg",
    "https://i.imgur.com/77vHD7r.jpg",
    "https://i.imgur.com/HvGGSUX.jpg",
    "https://i.imgur.com/iEZnnWb.jpg",
    "https://i.imgur.com/7K3XAjE.jpg",
    "https://i.imgur.com/xCBXRpD.jpg",
    "https://i.imgur.com/uvucFDU.jpg",
    "https://i.imgur.com/O9adSN4.jpg",
    "https://i.imgur.com/D38lDb4.jpg"
  ]
}