{
  "date": "2020-05-03T12:34:13.586Z",
  "title": "Tomita Tsukemen",
  "originalRecipe": "https://www.reddit.com/r/ramen/comments/c2xo60/tonkotsu_gyokai_tsukemen_tomita_style_here_it_is/",
  "author": "Ramen_Lord",
  "intro": "After the release of Ramen Heads, I swear to god, I must have gotten 30-40 requests to make a Tonkotsu Gyokai Tsukemen clone, alla Tomita, the legendary thick, sludgy, dip and the crazy, chewy, thick noodles. It’s like war in your mouth, a legit battle of flavor and texture. And y’all wanted it because you’re gluttons. It’s super addictive though. So. Good.\n\nWell, here it is. This recipe is bonkers. It’s also the most difficult recipe I have ever done. Seriously, the soup is a monster to make. Chances are you won’t be able to make it. It requires a ton of specialty ingredients, a big pressure cooker, a blender, a stock pot and various containers.\n\nSo, one final disclaimer. Please don’t ask me about substitutions. I don’t know them. If you want to make this without the ingredients I’ve described, that’s your prerogative but I can’t gurantee it’ll be any good. This dish is all about funky fish flavors and those flavors are not easily replicatable.",
  "components": [
    {
      "name": "Soup",
      "description": "This soup SUCKS to make. It’s messy and time consuming. But god it is amazing. You should expect to dedicate 5-6 hours making this soup if using a pressure cooker. A whole day if doing it in a normal pot.\n\n**Note**: if you opt to do this on the stovetop with a standard stockpot, multiply the cook time by 8, and cook at a simmer, boiling for the last hour. Also you’re insane if you do this on the stovetop.",
      "ingredients": [
        "4 L Water",
        "3 lb pork bones, mix of femurs and necks (1.3 kg)",
        "3.5 lb chicken backs (1.5 kg)",
        "1 lb chicken feet (0.5 kg)",
        "2.5 lb belly and skin and ribs, or 1 lb ribs, and a 2 lb pork belly roast, with skin included (1.5 kg)",
        "1 yellow onion, peeled and quartered",
        "4 coins ginger",
        "10 garlic cloves",
        "20g kombu",
        "80g niboshi",
        "50g thick cut katsuo bushi",
        "50g thick cut Sababushi",
        "30g gyofun (fish powder)"
      ],
      "steps": [
        "Add your water and pork bones to a pressure cooker, at least 8 qts, but preferably 10.",
        "Bring to a boil, and skim the scum, until little to none rises, around 20 minutes",
        "Cover, bring to high pressure, cook one hour.",
        "Meanwhile, deskin the pork belly, roll into a cylinder. If attached to the ribs, cut along the ribs to remove the belly first.",
        "While cooking, remove the toenails of the chicken feet. There can be dirt under the nails, it’s good to remove.",
        "Open the pressure cooker using fast release, add the chicken backs, chicken feet, tied pork belly, ribs, and pork belly skin.",
        "Close the pressure cooker, bring to high pressure, cook 1 hour.",
        "Fast release again, open the pressure cooker, remove the pork belly roll, and reserve for chashu.",
        "Add the onion, ginger, and garlic. Boil for 1 hour uncovered. Add water as needed to keep things submerged, but some evaporation is expected.",
        "Strain the soup, reserving the pulp of bones and meat and vegetables. Do not discard pulp. DO NOT DISCARD PULP.",
        "Dig through the pulp to remove large bones, like femurs, or extra chunky neck bones. You’ll notice at this stage that the bones are quite brittle and can break under pressure. Any bones you can crumble in your fingers are good to keep.",
        "Blend 2/3rds the bones, meat, vegetables, in a blender, with enough soup to make a slurry. Yep, that’s right, you’re blending bones here. It’s fine.",
        "Add the slurry back to the strained soup. Mix to combine. Yield is 3.5 L, add or boil water to get to this level.",
        "Add the slurry to a large pot, and add kombu and niboshi. Heat to 176F, and allow to steep for 20 minutes.",
        "Discard kombu, bring to a simmer, and add remaining ingredients (katsuobushi, sababushi, and gyofun).",
        "Remove from heat, steep 15 minutes. Stir frequently to prevent burning on the bottom of the pot, as the sludge can settle and scorch",
        "Strain soup through porous strainer to remove fish, pressing on pulp to ensure full extraction.\n\nFinal yield is around 2.5L, which is around 10 generous servings."
      ]
    },
    {
      "name": "Tare",
      "description": "It’s a soy tare with niboshi and katsuobushi. It’s super fishy and you add MSG. At Tomita, they use a Kaeshi, which is lighter and has salt, but… meh this is how I wanted to do it.\n\nYou’ll use around 30 ml of this tare for 200 ml soup. It should be quite salty",
      "ingredients": [
        "450 g soy sauce",
        "50 g mirin",
        "15 kombu",
        "20 g niboshi",
        "20 g sake",
        "20 g brown sugar",
        "15 g katsuo bushi",
        "5 g Haimi (or MSG, Haimi is a variety with Inosinate and Guanylate, synergistic compounds that improve sensation of umami on the palate)"
      ],
      "steps": [
        "In a container, add the soy sauce, mirin, kombu, and niboshi. Soak in the fridge for 6-24 hours",
        "When ready to cook, add the sake to a sauce pan. Boil for 5 minutes to reduce the alcohol",
        "Add your soy mixture, kombu and all, to the cooked sake in the pan. Bring to subsummer (around 175-180F). Turn off the heat, let steep 15 minutes",
        "Discard the kombu and bring the mixture to a simmer.",
        "Once simmering, add the remaining ingredients, stir, and remove from heat.",
        "Allow the mixture to steep for another 15 minutes, then strain. Reserve until needed."
      ]
    },
    {
      "name": "Noodles",
      "description": "The noodles are actually the easiest part to make. They’re high hydration and mildly low gluten in comparison to other types of noodles. But because they’re so thick, they take a while to cook. You’ll notice they’re basically the same as the ones for my Taishoken one. Well… those ones were super good, haha. I’ve just removed the egg white, which decreases the cook time.\n\nEach serving is 200g of noodles, so you’ll have to do some math. The below recipe makes 7 servings. The below is done by ratio in baker’s percentages, so feel free to scale up and down as needed.",
      "ingredients": [
        "940g King Arthur Bread Flour (94%)",
        "60 g whole wheat flour (this is optional, I like the color and flavor it adds, it also reduces some gluten formation) (6%)",
        "420 g water (42%)",
        "10 g kansui powder (8g sodium carbonate, 2 g potassium carbonate) (1%)",
        "10 g salt (1%)"
      ],
      "steps": [
        "Add kansui powder and salt to the water, dissolve completely. I like to add one at a time, these alkaline salts actually release a small amount of heat when hitting the water and will form small chemical bonds to themselves if not added gradually, which results in it clumping up. \n\nGo slowly, stir constantly until clear. This will take a while, but eventually things will work out.",
        "In a standing mixer with a paddle attachment, add your flours. Turn the mixer to “stir” and run for 30 seconds.",
        "While running the mixer on stir, add two thirds of your water mixture slowly, in an even stream. Let the mixer stir for 3 minutes.",
        "Add in the remaining water mixture with the mixer running, run for another minute, until small clumps begin to form.",
        "Remove the bowl from the mixer. Cover, and let this rest for at least 30 minutes, but an hour is fine. This gives the flour granules time to fully absorb the water and alkaline salts, rests some gluten (which, believe it or not, you developed while mixing this dough) and allows some trapped air in the dough balls to escape, which is called “degassing.” \n\nAn air free starch gel results in better texture. Don’t skip this.",
        "Knead it. The hardest part of noodles, hands down. Currently I use an electric pasta machine to sheet the dough, going through the largest setting, then the 2nd, then the 3rd. I then take the dough and fold it, sheeting under the 2nd widest setting, then fold it again and sheet it under the widest setting.\n\nI then repeat this again, until the sheet is quite smooth and not ragged. You'll notice interesting horizontal lines running along the length of your dough if you do the folding right, suggesting your gluten strands are running the length of your dough.\n\nThis is good; it will help with texture of the noodle. If sheeting with a machine isn’t an option for you, I used to throw the mix into a plastic bag and step on it repeatedly.",
        "After kneading, cover with plastic, and rest at room temp for another 30 minutes. This gives the gluten time to relax.",
        "Pull out your dough. Portion into workable sizes, and roll out to desired thickness (for me this is 3mm, I actually use a caliper to check, haha), using potato or cornstarch as you go to prevent sticking. \n\nDo this with a pasta machine, it is borderline impossible without a machine. An electric one will save you an incredible amount of effort.",
        "Cut your noodles with a pasta cutter. I cut with a 3mm wide cutter.",
        "Portion into 200 g portions, then put into a sealed container like ziplock, or Tupperware, and place in the fridge to rest for at least a day. \n\nThis final resting phase ensures even hydration and helps make an even starch gel, promoting better texture. Enzymatic activity in the flour also helps build flavor, and the alkaline flavor of the dough subsides somewhat."
      ]
    },
    {
      "name": "Chashu",
      "description": "",
      "ingredients": [
        "200 g soy sauce",
        "200 g water",
        "100 g mirin",
        "50 g brown sugar"
      ],
      "steps": [
        "Mix all the ingredients and the pork belly used in the soup making in a container",
        "Soak the cooked belly in the fridge until chilled thoroughly, then slice as needed as you like.",
        "Torch, steam, fry, whatever you want to reheat. You can use this tare for other stuff, like Jiro ramen."
      ]
    },
    {
      "name": "Egg",
      "description": "This is the same equilibrium brine egg technique I designed years ago.",
      "ingredients": [
        "Eggs",
        "Water",
        "Soy Sauce",
        "Mirin"
      ],
      "steps": [
        "Bring a pot of water to boil",
        "When the water is boiling, remove the eggs from the fridge, and prick a small hole on the bottom of each egg with a thumbtack. You can also use the heel of your knife to make an indentation there, by gently tapping it repeatedly.",
        "Add your eggs to the water, cook 7 minutes at full boil. Be sure to only add enough eggs that the water doesn’t lose temp too quickly. Do this in batches if necessary.",
        "While the eggs cook, prepare an ice bath.",
        "When the 7 minutes are up, remove the eggs and quickly place them in the ice bath to chill for at least 15 minutes",
        "Peel your eggs. There’s loads of tricks here, I like to crack the exterior all over by gently tapping the eggs on a surface, then peeling from the bottom. Some folks soak in vinegar, some like to do this all under running water.",
        "In a container, weigh out your peeled eggs and the weight of water to cover them. To this container, add 13% of this weight in soy sauce, and 10% this weight in mirin. So, as an example if my eggs and water covering them weighed 500 g, I’d add 65g soy sauce, and 50 g mirin.",
        "Store in the fridge for at least 24 hours, but up to 3 days with no degradation in quality."
      ]
    },
    {
      "name": "Other toppings",
      "description": "",
      "ingredients": [
        "Sliced green onion",
        "Nori",
        "Gyofun (Fish Powder)"
      ]
    },
    {
      "name": "Assembly",
      "description": "Dip the cold noodles into the hot soup, get that temperature contrast. Texture contrast of grit, chew. It’s intense stuff. And it’s GOOD. Maybe it’s good because it’s such a pain in the ass. Maybe it’s good because there’s like 50 things going on. But it’s so good. If you can get the ingredients for it, it’s worth making.\n\nFor one bowl:",
      "ingredients": [
        "One large bowl for noodles",
        "One small bowl for soup",
        "200ml soup (3/4 cup)",
        "30 ml tare (2 tbsp)",
        "200 g noodles",
        "1 tsp gyofun",
        "Toppings as desired (yuzu is also used in the original recipe… go for it)."
      ],
      "steps": [
        "Ensure all of your ingredients are ready. Green onions sliced, chashu sliced, and soups/tares are out with appropriate utensils. Ensure you have a small bowl for soup and a larger bowl for noodles and toppings.",
        "Bring a large pot of water to a boil",
        "In a saucepan, bring your soup to a simmer, and cover, keeping warm until needed.",
        "Set your oven to 170F, and add your small soup bowl to the oven to preheat. When the oven hits 170, turn it off and let the residual heat warm the bowl through.",
        "Add you noodles to the water, cook 7 minutes, swishing initially to prevent sticking.",
        "While the noodles cook, heat the chashu. I like to torch it. You can steam it, sear it, microwave it, other ways too.",
        "When the noodles are done after 7 minutes, strain well in a colander or fine mesh strainer, and rinse under cold water until chilled thoroughly. Arrange the noodles in the noodle bowl with the chashu, egg, and nori, and reserve until ready to eat.",
        "Prepare the soup bowl. Add tare and soup to the hot bowl. Top with fish powder and green onion."
      ]
    }
  ]
}