{
  "date": "2020-05-01T13:36:50.038Z",
  "title": "Tonkotsu Ramen",
  "author": "Ramen_Lord",
  "originalRecipe": "https://www.reddit.com/r/ramen/comments/2l2eas/here_it_is_the_granddaddy_of_them_all_homemade_18/?utm_content=comments&utm_medium=user&utm_source=reddit&utm_name=frontpage",
  "intro": "I have been asked over, and over, and over again to develop a tonkotsu method. It's by far and beyond the most beloved style in the states. I’ve made a few iterations, but they were always masked by something. Maybe black garlic oil. Maybe miso. Maybe gobs of sesame and chili even!\n\nBut as I’m sure many of you are aware, for the best tonkotsu bowls, that pork flavor is full forward, unapologetic in its presence, and rich as possible. To that end, I began messing around with an all-pork variant, and I’m pleased to say that I’d like to share the results of this testing. I believe this go around is **the best** tonkotsu I have ever produced. It’s the right color, the right texture, the right flavor, with nothing to hide behind.\n\nI present to you all, a pure, 100% pork, tonkotsu broth.\n\nNow, I won’t lie. It takes around 18 hours to make… but I have a few tricks to share to make this process less arduous. If you’re still interested, read on!",
  "components": [
    {
      "name": "Broth",
      "description": "\n\nThe ubiquitous tonkotsu broth requires three characteristics to turn white and creamy:\n\n* Low starch/sugar content in the boiling liquid.\n* High volumes of fat and gelatin.\n* Rapid agitation of the pot’s contents.\n\nIf any of these are off, you won’t get the tonkotsu you crave. Reasons below:\n\n* The sugars in aromatics (onion, carrot, apple) caramelize and turn brown. I had been chasing this idea that arromatics were required, but the truth is that most tonkotsu shops use an all-animal approach, opting to add aromatic compounds in things like tares and aroma oils later on.\n* Gelatin is a surfactant that emulsifies the fat from the bones, creating the characteristic opaque, white color. Getting the balance is key though; too much gelatin and your broth will be overly sticky and unappetizing. Not enough, and you won’t be able to emulsify the fat.\n* To get that emulsification, you have to churn the contents in some capacity, which decreases the size of the fat globules and allows them to emulsify. To do this, a*rapid boil*is required. Agitation also has the benefit of reducing the amount of water soluble proteins that rise to the surface, which can actually brown over time if they aren’t mixed back into the liquid.\n\nNow… for the tricks.\n\n* No one said this needed to rapidly boil all of the time. The rapid boil acts quickly to emulsify things if the gelatin level is appropriate. Which means the cooking can start at a simmer, and build up later! So you can actually start this the night before, keep things at a safe, low temp during the night, and then crank it up to high heat the next day, with the same results.\n* Covering the pot increases the pressure in the vessel, which helps promote agitation, saves heat, and water. Do it.\n* You can use a combination of bones. Can’t find femurs? Try neck bones. This iteration uses half neck bones, half femurs.\n* The addition of fatback boosts the fat levels, creating the right balance of fat to gelatin.\n\n\n\nNotes: Makes maybe 8 qrts of stock total.",
      "ingredients": [
        "8 lbs total in bones (I used half femurs, half neck bones. All neck will work in a pinch)",
        "About .8lbs fatback. (10% the weight of the bones)."
      ],
      "steps": [
        "Before any cooking, soak the bones in cold water in a large, non-reactive vessel, for at least 6 hours, and up to 24 hours. (I use a large plastic container).",
        "The night before you want your broth ready, drain the bones, add them to a pot with fresh water covering them by 2 inches, and bring to a boil over high heat.",
        "Drop the heat to medium, and blanch the bones, at a simmer, for 15-30 minutes, or until little to no scum rises.",
        "Strain the bones again, and scrub away any black material, such as coagulated blood, from the bones and pot.",
        "Return the bones to the pot. Add fresh water, and add in the fatback. If doing the night before, bring this to a boil, then down to the lowest setting on your stove, and cover. Then go to bed. If not, continue to step 7.",
        "In the morning, bring the pot back up to a full boil, then back down to the lowest setting possible to mantain that jostling boil while covered. (For me, this is medium on my stove)",
        "Depending on when you started cooking, continue to boil the broth for 12-18 hours, or until desired consistency and color is reached, meat has completely separated and broken down in the broth, and fatback pieces have mostly melted. Optionally, you can stir every 1-2 hours just to check up on things and promote more churning. \n\nPlease feel free to add back water if the level gets too low.",
        "Once cooked to your liking, strain the broth, discarding the solids, and reserve broth until needed over low heat. This broth keeps for around a week in the fridge."
      ]
    },
    {
      "name": "Tare",
      "description": "The secret to a killer tare for tonkotsu is a**shoyu**base tare with some nice fish elements. Nothing overly fishy or soy-forward, but merely backdrop items to boost the pork flavor and umami of the dish. It’s one part fish broth, one part soy base. \n\nThis is a bit of a combo of some previous techniques I’ve used, and Ivan Orkin’s soy tare. I like it.",
      "ingredients": [
        "5 3 inch by 3 inch squares of kombu",
        "Water to cover (around 1-2 cups)",
        "¾ cup dried niboshi",
        "1 tbs sesame oil",
        "1 cup loosely packed bonito",
        "¼ cup sake",
        "¼ cup mirin",
        "1 cup soy sauce (I use a combination of usukuchi, good ol’ standard kikkoman, and a white soy sauce)",
        "Salt to taste"
      ],
      "steps": [
        "Cover the kombu with water enough to cover. Let sit overnight, or at least 3 hours, in the fridge.",
        "When ready, add sesame oil to a medium sauce pan over medium heat.",
        "When oil is shimmering, toss in the niboshi, sauteeing in the oil for 40 seconds to a minute, or until brown and fragrant. Try not to get this too hot, as bitter flavors might develop if the fish is overheated.",
        "Add the kombu and kombu’s soaking liquid. Bring to 176 degrees (shoutouts to Ivan Orkin for this temp).",
        "Remove the kombu, add the bonito, and steep the niboshi and bonito in this liquid at 176 for 10 minutes.",
        "Strain broth, and reserve while making soy base.",
        "In the pot, add in the mirin and sake, and cook at a boil to remove the alcohol, around 5 minutes.",
        "Add in the soy sauce, and bring to 176 again. Let sit at this temp for a few minutes to concentrate.",
        "Add in an equal part of the fish broth made earlier. Season with salt until quite salty (like, to the point that you’d go “WOW this is almost too salty for me to handle, but damn it’s nice).",
        "Done. Taste it with your broth and adjust as needed. Maybe it needs more soy? Maybe it needs more salt? Maybe some extra umami. Only you can judge."
      ]
    },
    {
      "name": "Noodles",
      "description": "**Hakata noodles** are low moisture, low protein, lower alkalinity. The recipe has been adjusted to fit this; I’ve played around with making a true Hakata noodle, but hydration for those is around 22%. At home, this is almost impossible to manage. So the below recipe is more in line with other regions of Kyushu, but it pairs nicely. More taut than a standard noodle, and less alkaline.\n\nAlso… feel free to buy sun noodles for this. Seriously, noodles are hard. And Tonkotsu is a time consuming endeavor.\n\n(measure everything by weight)",
      "ingredients": [
        "99 g Bread flour",
        "1 g vital wheat gluten",
        "36 g water",
        "1 g baked soda",
        "1 g salt"
      ],
      "steps": [
        "Add baked soda and salt to the water, dissolve completely. I like to add one at a time, it seems like the baked soda dissolves better if added prior to the salt.",
        "In the food processor, add your wheat gluten and flour. Pulse a few times to combine the two.",
        "While running the food processor, add your water mixture slowly, in an even stream. Occasionally, stop to scrape the sides down. You know you're set when you have tiny grain like pieces.",
        "Cover the food processor and let this rest for 30 minutes. This gives the flour granules time to fully absorb the water and alkaline salts.",
        "Knead it. I used to throw the mix into a plastic bag and step on it repeatedly, which simulates the kneading process used in an industrial setting. \n\nCurrently I use an electric pasta machine to sheet the dough, going through the largest setting, then the 2nd, then the 3rd, then folding and repassing through the largest setting. I repass two to three times, or until I notice the dough is making the machine work really hard. I also like to fold the dough the same direction each time. \n\nSome articles I read suggested this kept the gluten strands running in the same direction, which promotes better texture. You'll notice interesting horizontal lines running along the length of your dough if you do it right.",
        "When smooth, cover with plastic, and rest at room temp for an hour. This gives the gluten time to relax, and “ripens” the dough.",
        "Pull out your dough. Portion into workable sizes (around one serving's worth), and roll out to desired thickness, using potato starch as you go to prevent sticking. Do this with a pasta machine, it is borderline impossible without a machine. An electric one will save you an incredible amount of effort.",
        "Cut your noodles to your desired thickness. I like mine rather thin for tonkotsu, but you rule your ramen.",
        "Store for up to 2 days in the fridge, or indefinitely in the freezer."
      ]
    },
    {
      "name": "Aroma Oil",
      "description": "This aroma oil for this bowl, in my opinion, is completely optional. In fact, I might recommend not adding it this go around, just to enjoy the pure pork pleasure. But it’s simple as usual.\n\nMelt a half cup of lard. Add in a handful of garlic cloves, and cook over low heat, until the garlic is golden. Strain."
    },
    {
      "name": "Toppings",
      "description": "Other toppings are typical. \n\nFeel free to browse other recipes on the site for inspiration.",
      "ingredients": [
        "Soft boiled steeped egg",
        "chashu",
        "green onion",
        "ground black pepper",
        "sliced woodear mushroom (just reconstituted per package instructions)",
        "benishoga"
      ]
    }
  ],
  "images": [
    "https://i.imgur.com/UWna9A1.jpg",
    "https://i.imgur.com/pzugVvn.jpg"
  ]
}