{
  "date": "2020-05-01T13:54:10.999Z",
  "title": "Tonkotsu Ramen (Pressure Cook)",
  "author": "Ramen_Lord",
  "originalRecipe": "https://www.reddit.com/r/ramen/comments/7arli8/fresh_dont_feel_like_spending_18_hours_making/?utm_content=comments&utm_medium=user&utm_source=reddit&utm_name=frontpage",
  "intro": "I’ve been exploring the idea of altering my tonkotsu recipe. Right now that takes too long for most people to try it, and it’s really involved. 18 hours! Too long!\n\nThe thing is, home cooks aren’t alone in this hatred of double-day cookathons. Restaurants also have this problem after all. So many have opted for cooking Tonkotsu in a pressure cooker. They make massive, hundred quart pressure cookers in Japan for this very reason.\n\nI won’t get into the chemistry of pressure cooking (there are people far more eloquent out there who have written about it extensively), but the gist of it is that pressure cookers increase the boiling point of water due to the pressure in the pot, allowing you to cook things*way*faster in a moist environment. \n\n### A broth that takes 6 hours now only takes 1.\n\n\n\nNow, the legendary J. Kenji Lopez Alt ([/u/j_kenji_lopez-alt](https://www.reddit.com/user/j_kenji_lopez-alt)), when he wrote his tonkotsu recipe that often gets cited here, wrote very explicitly that a pressure cooker wouldn’t work for tonkotsu. A pressure cooker doesn’t jostle and actually bubble (the pressure in the pot prevents a rapid boil), which is integral to the emulsification of the fat and water in a tonkotsu.\n\nExcept… well… you can totally cook a tonkotsu in a pressure cooker. Sorry Kenji. You just need to get that rapid boil in at some point, which you can do *after* the bulk pressure cooking. The gelatin will work pretty quickly to emulsify things together.\n\nSo here’s the method. I don’t think this is perfect yet, but I thought I’d share as an alternative to having a pot on the fire for 18 hours. For the other components, I’ve also included them in the bottom.",
  "components": [
    {
      "name": "Broth",
      "ingredients": [
        "2 lbs neck bones",
        "2 lbs femurs, split to expose marrow",
        "4 lbs fatback",
        "Optional aromatics: ½ onion, 6 garlic cloves"
      ],
      "steps": [
        "The night before, or at least 6 hours prior to cooking, soak your neck bones and femurs in water in a cold, non-reactive vessel. I use a big Tupperware container. (Technically this is optional, but I find the resulting tonkotsu is whiter in appearance).",
        "When ready to cook, add your neck bones and femurs to a pot with fresh water. Bring to a boil, then down to a simmer, and skim the scum that rises to the top of the pot. Do this for 15-20 minutes, or until little scum is rising. \n\nThe scum goes through several phases here, you’ll know when the scum is pretty much done rising up. This blanch is integral for a white tonkotsu, don’t skip it, and don’t end it prematurely.",
        "Strain the bones from the blanching liquid. Discard the liquid.",
        "Scrub and clean the bones under running water, removing any black or dirty looking particulate that may be on the outside of the bones or in crevices.",
        "Add your now clean bones to a pressure cooker, covering with just enough water. Bring to a boil, then cover, bring to full pressure (15 PSI), and cook under pressure for 2 hours",
        "Fast release the pot, being careful to avoid splashes (if your pressure cooker doesn’t have this feature, regular release is fine).  Give the contents a stir, then cover, bring to high pressure again, and cook for 1 hour.",
        "Remove pressure and open the cooker. Add in your fatback, give it a stir, bring the contents back to a boil, and cook under pressure for one more hour.",
        "Depressurize the pot. Remove the fatback, adding it to a blender. Blend with an appropriate amount of broth until the fatback is completely broken down into a liquid, then add this back to the broth.  No chunks here, we’re looking for smooth liquid.",
        "If using, add aromatics to the now uncovered broth",
        "Cook, uncovered, at a rapid boil, for 45 minutes, or until the broth is opaque, creamy, and to the desired consistency you want. Stir occasionally to prevent scorching on the bottom of the pot.",
        "Strain and reserve as needed. Conversely, store in the fridge for up to 5 days, or freeze for several months."
      ]
    },
    {
      "name": "Noodles",
      "description": "I made some really low hydration noodles for this one, which I cannot recommend making. 30% hydration. They were awesome. And impossible to make at home. \n\n*Don’t make these. You’ll hate yourself.* \n\nBut ratios are below (Seriously don’t make this recipe. Just buy the noodles from Sun Noodle. They’re quite good.)\n\nFor one portion:",
      "ingredients": [
        "99 g 00 Bread flour (I used Antimo Caputo, the 00 means the flour is milled very finely and this helps with hydration)",
        "1 g Vital wheat gluten",
        "1 g salt",
        "1 g dry kansui (In this case, .9 g Potassium Carbonate .1 g Sodium carbonate)"
      ],
      "steps": [
        "Add kansui powder and salt to the water, dissolve completely. I like to add one at a time, these alkaline salts actually release a small amount of heat when hitting the water and will form small chemical bonds to themselves if not added gradually, which results in it clumping up.\n\n Go slowly, stir constantly until clear. This will take awhile, but eventually things will work out.",
        "In a standing mixer with a paddle attachment, add your flour, Turn the mixer to “stir” and run for 30 seconds.",
        "While running the mixer on stir, add two thirds of your water mixture slowly, in an even stream. Let the mixer stir for 3 minutes.",
        "Add in the remaining water mixture with the mixer running, run for another minute, until small clumps begin to form.",
        "Add the mixture to a ziplock style bag. Close, and let this rest for 30 minutes. This gives the flour granules time to fully absorb the water and alkaline salts, rests some gluten (which, believe it or not, you developed while mixing this dough) and allows some trapped air in the dough balls to escape, which is called “degassing.” \n\nAn air free starch gel results in better texture. Don’t skip this.",
        "Knead it. For these really low hydration ones, I did the stepping technique, then rolled. As in, put the plastic bag on the floor, and step on the contents until it sticks together. \n\nThen take a chunk of this thick sheet, and roll it out with your machine, going through the largest setting, then the 2nd, then the 3rd. Fold, making sure to fold to keep the direction of the dough consistent, repeating this process. until the sheet is quite smooth and not ragged. \n\nThis process sucks. Again, don’t do this recipe. It’s hard.",
        "After kneading, cover with plastic, and rest at room temp for another 30 minutes. This gives the gluten time to relax.",
        "Pull out your dough. Portion into workable sizes, and roll out to desired thickness, using potato or cornstarch as you go to prevent sticking. Do this with a pasta machine, it is borderline impossible without a machine. An electric one will save you an incredible amount of effort.",
        "Cut your noodles to your desired thickness. I used an angel hair attachment, so they were quite thin here.",
        "Place in the fridge and allow to rest for at least a day. This final resting phase ensures even hydration and helps make an even starch gel, promoting better texture. Enzymatic activity in the flour also helps build flavor, and the alkaline flavor of the dough subsides somewhat."
      ]
    },
    {
      "name": "Tare",
      "description": "The tare here was super quick turn, soy based (hence the slightly brown hue). I eyeballed it to be honest. Eh, it was fine, the original tonkotsu tare is probably better. See below for approximations.",
      "ingredients": [
        "100 g water",
        "150 g soy sauce (mostly usukuchi for color)",
        "10 g small niboshi",
        "20 g brown sugar",
        "40 g salt",
        "5 g MSG (optional, but not really, Tonkotsu needs MSG imo)"
      ],
      "steps": [
        "Combine the above in a small saucepan, and bring to a boil to dissolve the salt and sugar.",
        "Allow to cool, then strain."
      ]
    },
    {
      "name": "Aroma Oil",
      "description": "I used a quick garlic aroma oil for this bowl. Pretty easy.\n\n1. Take a **half cup of lard**, and cook **12 garlic cloves** in it over medium low heat in a saucepan, until the garlic begins to turn toasty and brown, around 15-30 minutes depending on your stove.\n2. Remove from heat, cool in the pan, and then strain. \n\nYou can reserve this fat in the fridge indefinitely."
    },
    {
      "name": "Chashu",
      "description": "High temp sous vide chashu. You SHOULD do this, it’s a nice balance between braised and steaky, tender but not overly-melty. And it’s pretty easy.",
      "ingredients": [
        "Pork belly",
        "½ cup mirin",
        "½ cup soy sauce",
        "1 cup water",
        "1 tbsp brown sugar",
        "¼ cup sake"
      ],
      "steps": [
        "Preheat the waterbath to 174F.",
        "Sear the pork belly on all sides in a pan until golden brown, then place in vacuum bag.",
        "Deglaze the pan with the remaining ingredients, then reserve this liquid and allow to cool.",
        "When liquid has cooled, add it to the bag with the pork.",
        "Cook the pork belly sous vide for 7 hours, but up to 12 hours. You do NOT have to vacuum seal this, just use the water displacement method to remove excess air, and clamp the edge of the bag to the pot or vessel you’re sous-viding in.",
        "Remove from the bath, and shock in ice water to chill quickly. Reserve in the fridge if needed."
      ]
    }
  ],
  "images": [
    "https://i.imgur.com/zOkb9sz.jpg",
    "https://i.imgur.com/6UuAyHr.jpg",
    "https://i.imgur.com/qt19BDf.jpg",
    "https://i.imgur.com/sZmzXBQ.jpg"
  ]
}